gicking/STM8_headers/SVD/STM8S207S6.svd
      </registers>
      <interrupt>
        <name>CLK_CSS</name>
        <description>CLK_CSS interrupt</description>
        <value>2</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <baseAddress>0x7F00</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>11</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0060</offset>
        <size>1</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CPU</description>
      <groupName>CPU</groupName>
      <registers>
        <register>
          <name>A</name>
          <description>Accumulator</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PCE</name>
          <description>Program counter extended</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PCH</name>
          <description>Program counter high</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PCL</name>
          <description>Program counter low</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>XH</name>
          <description>X index register high</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>XL</name>
          <description>X index register low</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>YH</name>
          <description>Y index register high</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>YL</name>
          <description>Y index register low</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>SPH</name>
          <description>Stack pointer high</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x17</resetValue>
        </register>
        <register>
          <name>SPL</name>
          <description>Stack pointer low</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>CCR</name>
          <description>Condition code register</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x28</resetValue>
          <fields>
            <field>
              <name>C</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Z</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I0</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>H</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>V</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_GCR</name>
          <description>Global configuration register</description>
          <addressOffset>0x0060</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SWO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DM</name>
      <baseAddress>0x7F90</baseAddress>
      <addressBlock>
        <offset>0x0000</offset>
        <size>11</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DM</description>
      <groupName>DM</groupName>
      <registers>
        <register>
          <name>BK1RE</name>
          <description>DM breakpoint 1 register extended byte</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RH</name>
          <description>DM breakpoint 1 register high byte</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RL</name>
          <description>DM breakpoint 1 register low byte</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RE</name>
          <description>DM breakpoint 2 register extended byte</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RH</name>
          <description>DM breakpoint 2 register high byte</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RL</name>
          <description>DM breakpoint 2 register low byte</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>CR1</name>
          <description>DM debug module control register 1</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CR2</name>
          <description>DM debug module control register 2</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CSR1</name>
          <description>DM debug module control/status register 1</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x10</resetValue>
        </register>
        <register>
          <name>CSR2</name>
          <description>DM debug module control/status register 2</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>ENFCTR</name>
          <description>DM enable function register</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
